{
    "aaron-peskin": "An enduring presence in San Francisco politics, Supervisor Peskin was first elected to the Board in 2000 as part of the progressive vanguard seeking to check the centralized power wielded by Mayor Willie Brown. A prolific legislator and long-time power broker, Peskin has spent decades leveraging his political power toreduce the mayor's powerand to obstruct the meaningful construction of housing in the city. Housing Perhaps no politician in the modern era is more responsible for the city's housing crisis than Aaron Peskin. Almost every root cause of the housing shortage—including empowerment of neighbors to single-handedly block projects; abuse of environmental laws; extensive bureaucracy, taxation, and fees; the alignment of far-left politicians with housing opponents; and frequent interference with specific projects by the Board of Supervisors—has been created, exacerbated, or encouraged by Peskin throughout his many years in office. Peskin's work to block housing development began early: as a student at UC Santa Cruz,he filed a lawsuitto stop the university from building dorms. As he would often do to attack housing in San Francisco, he used environmental law as the basis for his suit—the California Environmental Quality Act, orCEQA, is frequently abused by housing opponents. Upon moving to San Francisco he continued his anti-growth mission, becoming president of the Telegraph Hill Dwellers,described by the Chronicleas \"a powerful lobbying group that is deeply opposed to development.\" Under his leadership, the groupblocked an expansion by City Collegein Chinatown. Before joining the Board of Supervisors, he worked tomake CEQA complaints directly appealable to the Board.When his first term on the Board began in 2001, he immediately joined its Land Use Committee, where he focused on giving the Board more control of the city's Planning Commission and Board of Appeals (which rule on neighbor objections to housing projects). By the time term limits forced Peskin off the board, he was established as \"an unapologetic foe of development who earned his stripes fighting new projects.\" Living up to that reputation, he continued warring against housing as a private citizen. He once again used a neighborhood group, this time \"Citizens for a Sustainable Treasure Island,\" whichsued to prevent the development of 8,000 homeson the man-made island in the bay. Peskin's anti-housing crusade continued after he rejoined the Board in 2016. In his second round as a supervisor he has opposed everything from building 495 units of housing on the site of avalet parking lot, tostreamliningthe city's Kafkaesque permitting rules; toconvertinga single-family townhome to condominiums. As Board of Supervisors President, Peskin has the power to appointthree of the seven commissionerson the main body that reviews housing disputes, the Planning Commission. He can also use the Historic Preservation Commission, which he created in 2008 (all seats on which require Board of Supervisor approval, of course), and which can shut down changes to any building or place deemed to be of historical interest. A favored tactic has been to threaten properties with landmark status to bring approval under the purview of the commission - even questionable \"landmarks\" likethe interior seating configuration of the Castro Theater. Notably, Peskin is a landlord who rents outthree houses(the most of any member of the Board of Supervisors), and he benefits financially from housing scarcity (which keeps rent high). He also lives in a home formed bymerging what was once a rent-controlled duplex. His merged home was discovered shortly after Peskinproposed legislationto ban turning smaller units into larger homes; critics noted the apparent hypocrisy, along with questionable details like Peskinhaving apparently bulliedthe former owner into selling the home to Peskin's family at a $700,000 loss. The Department of Building Inspections found that Peskin's use of the entire duplex wasnot technically illegal: the two units weren't officially merged into one because both halves of the building still had kitchens. While Peskin has done much to earn his reputation as an arch-NIMBY, he has occasionally been willing to support housing, especially if it's far from his district. He previouslysupportedthe Hunters Point Shipyard redevelopment, a development in Parkmerced, and upzoning of certain eastern neighborhoods in the city. And after the state threatened to take away the city's ability to restrict housing unless San Francisco meets minimum building requirements, Peskin was willing tojoin the mayor in passing pro-housing legislation. As sentiment in the city shifts in a more housing-friendly direction, we may discover that Peskin's interest in winning elections tames his desire to block housing—at least, as long as it isn't in his North Beach neighborhood. Limiting Mayoral Power San Francisco once had a \"strong mayor\" system, in which the mayor was largely responsible—and accountable—for the way the city ran.From the momenthe first became a supervisor in 2001, Peskin has worked to shift power away from the mayor's office, distributing it to the Board of Supervisors either by the creation of unelected commissions to oversee a city department or by shifting the power to appoint commissioners away from mayor's office. Sometimes he used both tactics in tandem. In practice, this means that Mayor Brown, elected in 1995, directly controlled 19 departments and the Board of Supervisors controlled 3 departments. In 2023, Mayor London Breed controls 12 departments and the Board of Supervisors controls 16. Interested in the details? Learn more in GrowSF's detailed report on howPeskin killed San Francisco's strong mayor system. Crime & Drug Use Peskin vociferously supported defunding the police in 2020,callinga $120 million reduction in the SFPD budget \"a reasonable first step\" and declaring himself a \"proud supporter\" of removing police staffing minimums (now, years later, the city has aseverepolice shortage). Heopposedrecalling former DA Chesa Boudin, who voters ousted after Boudintook a lax approach tocrimes like public drug abuse and petty theft, even asviral theft incidentsbecame commonplace andoverdose deaths skyrocketed. Since Boudin's recall, Peskin has \"seemed tomove to the center on drug dealing and use on public streets,\" although the change may be more style than substance. For example, Peskindemandedthat Mayor Breed take questions from the Board of Supervisors in a drug-saturated public plaza instead of within City Hall. He had to stop the meeting after only 11 minutes, when anti-police protestors drowned out Peskin's voice; as the meeting concluded, one protester threw a brick that hit a high school student in the audience. Peskin hasdemandedthat Breed \"shut down all public drug dealing in open air sites . . . in the next 90 days,\" but he expressed no willingness to fund the effort, claiming that the problem was not one of resources, but of coordination. Environment Environmentalism is one of Peskin's stated priorities, but his brand of environmentalism seems to primarily focus on preservation at all costs and many of his political moves—especially fighting against housing density—fly in the face ofevidence for the greater environmental good. When not in office, Peskin isPresidentof aNevada environmental non-profit. Streets and Transit Supervisor Peskin generally favors public transit and bicycles, but his support is inconsistent and he has repeatedly reversed himself on transit issues. In 2007, he authored (and passed) acomprehensive set of reformsto MUNI governance and funding, stripping influence away from the Board of Supervisors and giving the system more reliable and more flexible funding. He has since called the reforms an \"abject failure\" and proposedstrippingthe city transit authority of its ability to raise fares.Peskininitially backed the Central Subway Systembeforereversing courseand opposing it.He's a member of theVision Zero committee,which aims to completely eliminate traffic deaths in San Francisco, but opposes safer alternatives to cars likeautonomous vehicles,scooters, andstationless bike sharing programs.He voted forGreat Highwayto stay closed to cars on weekends, butvoted against car-free JFK.He seems generally opposed to parking lots, unless people are trying to turn those parking lots into housing—then he's pro parking lot. One theme that does seem consistent:as a cyclist himself, Peskin is often in favor of bikes and more traditional forms of transit, but generally opposes transit ideas from tech companies (e.g., ride sharing, scooters, bike-shares, or self-driving cars). Fun Peskin has developed a reputation for hindering fun events across the city. In his first term, a landmark San Francisco bar was temporarily shut down after a group of neighbors,including Peskin's wife, complained about it. Once the Peskins got involved, city officials rescinded the bar's authorization to operate without serving food. Next, Peskin managed toshut down the San Francisco Grand Prix, an annual bike race that used to take place in North Beach. Peskin claimed that the event's sponsors owed the city money for traffic cops deployed at the event, saying it was: \"a problem, a very serious problem. I am outraged!\" Not long after that, the city's Parks and Recreation department denied an alcohol permit to the North Beach Festival for the first time in 30 years; the festival's sponsorattributed the denialto political pressure from Peskin. Between his supervisor stints, Peskin sued the America's Cup boat race. As he so often has, he used a neighborhood group—this time \"Waterfront Watch\"—to filean environmental lawsuit. He sought to prohibit the race from preparing team or spectator sites along the waterfront, which would \"doom the races\" if he succeeded. The race went forward that year, but it left San Francisco for Bermuda afterward; Peskin had \"no regrets\" about the event's departure. After returning to the Board, Peskin waged a small war against the Golden Gate Park ferris wheel. Despite approval from two separate city committees to extend the ferris wheel for four years so that SF families and visitors can have fun, Supervisors Peskin and Connie Chan dragged the contract before the full Board of Supervisors for review under the pretense that the ferris wheel, a temporary installation, was in fact a \"permanent structure.\" Peskin tried to overrule the four year extension, but ultimately lost the vote.Peskin then tried to argue that the ferris wheel would require two thirds Board of Supervisors approval, due to the revenue sharing component of the deal. We can only speculate on his intentions. Did it do it because he's against fun? Because, perhaps, he really hates ferris wheels? Or... maybehe just really wanted the ferris wheel to be in his district. Personal scandals No one's ever accused Aaron Peskin of being too nice. Although he seems to have tempered his most abrasive tendencies in recent years, Peskin's behavior during his first two terms caused reporters to dub him the \"Napoleon of North Beach.\" He has adocumented history of calling to harangue various political leaders late at night, often while drunk, and in particular fortargeting female department heads. What is it like to be on the other side of Aaron Peskin late night call? Well, he mightthreaten your jobormove to disband yourentire department, just because you dared to disagree with him. Eventually, Peskin's political opponents were so frequently and severely harassed that theybegangoing public and filing misconduct complaints. The Executive Director of the Port of San Francisco filed a complaint and sent a letter to then-Mayor Gavin Newsom's office reporting that Peskin threatened the jobs of port members, harassed her repeatedly, and threatened thathe'd be \"going after her.\"Newsom's director of climate protection initiatives went public with allegations that Peskintwice threatenedto eliminate his job out of spite. In a strange coincidence, Peskin introduced a measure that would have slashed the city Department of the Environment, but the city attorney deemed the measure illegal.Another city supervisor reported that Peskin retaliated against her by switching his vote and killing one of her initiatives, and told her: \"Payback is a bitch.\" Peskin responded, on record to the Chronicle:\"She's a whiny brat, and she has been a whiny brat ever since she arrived at the Board of Supervisors.\" With these reports the floodgates opened, and Peskin's abusive behavior became a topic of public discussion. AsGavin Newsom put it: \"Everyone's been hearing this for years. I don't think there's a person in city government who's surprised . . . I don't think anyone that I've met in elected office or a community leader hasn't received these types of calls.\" When Peskin ran for re-election,he promisedthat he had changed: \"I have learned and listened and grown and matured.\" Sadly, he had not. In 2018, he showed up at a burning building,intoxicated and out of control, profanely insulted the fire fighters, tried to give them commands, and lambasted the Fire Department chief (who was female) for not answering his calls during the fire. After the chief criticized Peskin for interfering with an active fire scene, he issued an uncharacteristicapology. But his bad behavior continued. In 2021, after continuing reports of abuse, and ofshowing up to work intoxicated, Peskin announced that he hadentered alcohol treatmentand attributed his past misconduct to drinking. Even that was not the end, though. In 2022, Peskin had to publicly apologize again for remarks implying thata transgender supervisor candidate wasn't \"real\" or \"human.\"And in 2023, he was caught on tape calling a community leader from his district \"a horse's ass\" at a Board of Supervisors meeting.",
    "ahsha-safai": "Here's where Supervisor Safaí stands on the issues: Housing As one of the city's more pro-housing supervisors, Safaí has generally supported housing production, includinginitiativestospeed up the city's approval process. He has said that he's focused on the \"missing middle\" of San Francisco - people who make too much to qualify for low-income housing but who make too little to afford the units priced at the full market rate. But Safaí has sometimes opposed housing initiatives, too, like when heblocked developmentof 1,300 units--350 of which would have been affordable at lower income levels--at the request of acorruptnon-profit called TODCO. He has also indicated that hemay opposemodular housing--affordable pre-made housing that can be constructed on-site--unless labor interests can be appeased. Some unionsopposemodular housing because the process doesn't require as much high-cost labor to build. As theformer political director for SEIU 87, the San Francisco Janitors Union, Safaí has strong ties to labor groups, which have historicallysupportedhim. Public Safety Safaí was among the first supervisors to advocate for cracking down on retail crime. In July 2021, hecalled outthe city's \"laissez-faire\" attitude to organized retail crime. After a mass looting event at Union Square a few months later, heobservedthe impact on the city's budget: \"If retail frontline workers don't feel safe, if shoppers don't feel safe, stores will ultimately shut down. If stores shut down, we lose sales tax.\" He subsequentlypushed fora permitting process for street vendors, to cut down on fencing of stolen goods. In late 2021, Safaí introduced legislation to allow commercial stores to hiresheriff's deputiesto fill security staffing shortages, acting as a visual and physical deterrent to retail crime. The measure later passed in the Board by 7-3. \"When we heard that San Francisco was one of the epicenters for organized retail crime, we knew we had to act, and we knew we had to act swiftly,\"he said. Safaí has himselfbeen the victimof property crime twice - his car was broken into while parked outside of city hall, and his home was burglarized while undergoing renovation. Running for Mayor \"We're at a crisis point in our city,\"Safaí toldthe San Francisco Examiner, saying that Mayor London Breed has failed to bring together the people to solve the existing issues around crime, homelessness, and a declining economy. But as supervisor, Safaíhas historically been an ally of the mayor'sand has often voted for her priorities. And where he has differed from Breed, voters may not always prefer his positions. For example: Unlike Breed, whosupported the school board recalls, Safaí failed to take a position. Voters supported the recalls byhuge margins.He also declined to take a position on therecallof former DA Chesa Boudin. While Breed never formally supported the recall, she was a frequent critic of Boudin and her silence wasviewed by manyas tacit approval.Unlike Breed, Safaí wanted to re-open JFK Avenue in Golden Gate Park to cars. Voters disagreed, choosing to keep JFK as a car-free promenade for pedestrians and cyclists by an overwhelming30% margin. On the other hand, Safaí sponsored legislation to create a new Homeless Oversight Commission, which67% of voterssupported; Breed opposed the measure,arguingthat it would create more bureaucracy than accountability.",
    "catherine-stefani": "Supervisor Stefani's top priorities include: Gun control An ardent supporter of common-sense gun control, Stefani has repeatedlypointed outthat we can do more to \"take guns out of the hands of people who are a danger to themselves or others.\" Stefani sponsored legislation proposing a ban on ghost guns in San Francisco, the first of its kind in California. Ghost guns are firearms that can be purchased in individual pieces online and assembled at home, bypassing background check requirements - a workaround thatStefani called a \"massive loophole.\"After Stefani's legislation passed in San Francisco, the initiative spread and became a statewide ban. Stefani was also a leader in the local chapter of Moms Demand Action for Gun Sense in America, and continues to work with the organization. Public safety and policing Stefani, who chairs the Board of Supervisors' Public Safety and Neighborhood Services Committee, has prioritized adequately staffing the San Francisco Police Department. To address growing staffing shortfalls, she joined 9 other supervisors in April to increase police salaries. Stefani meets regularly with SFPD and publicly supports their efforts, andhas told the Chroniclethat her constituents are begging for more police. Nonprofit oversight and accountability San Francisco has outsourced many key government functions to nonprofit groups, leading to repeated problems withcorruption,mismanagement, andwaste. After the city Controller's Office publishedan auditthat called out problems with how nonprofits' success is measured, Stefaniasked the City Attorney's officeto prepare legislation to standardize success and performance metrics. Stefani has also led the Board of Supervisors in investigating theft and corruption by nonprofits,noting her \"serious concerns\"with how the city manages its nonprofit contracts. Supporting small businesses \"For me, small businesses just really represent the fabric of who we are in San Francisco,\" Stefanihas said. In the midst of COVID pandemic lockdowns, Stefani tackled what she called \"impediments'' to small businesses staying afloat. These efforts included co-sponsoring theShared Spaces Program(restaurant parklets) andauthoring legislationto reduce fees for small businesses, stating that the city needs to \"stop viewing small businesses as ATMs.\" Affordable housing Stefani is a proponent of increasing housing for people of all income levels, including improving city policies tomaximize production of affordable housing. As discussed below, she has repeatedly followed through with key votes in favor of housing, and to help projects succeed despite opposition.",
    "connie-chan": "Supervisor Chanhas stated thatshe would like to see changes in small business support, accountability in city governance, homelessness, transit, support for working families and energy infrastructure. In practice, Chan has been a member of theBoard's progressive blocand a key opponent of new housing development and transportation reform. She has repeatedly introduced legislation designed to obstruct meaningful change in these areas, including hersolo standagainst all possible political compromiseduring the car-free JFK campaign. Housing District 1 has thelargest shortage of affordable housingin the city, and had the lowest number of new units (of any kind of housing) in construction as of Q4 2022. Supervisor Chan's solution is to push for\"100% affordable housing in our new housing development,\"which would require developers to lose money on anything they build. In practice, this means that she opposes nearly all new development. This has resulted in astringofvotesblocking much-needed new housing and the introduction oflegislation, notably Prop E, designed to impedeany attempt to streamline development. For example, within her own district, Chan has rejected developer proposals to create newhousing at the Alexandria Theatreand is now threatening to landmark the property for historic preservation. The property has sat vacant since 2004 and isslowly deteriorating. And on the other side of the city, Chan voted against the construction of 495 units of new housing at 469 Stevenson Street in SOMA, a decision that sparkedwidespread outrageand triggeredcity-level investigationsandstate intervention. Transportation Supervisor Chan has been a key opponent of attempts to provide car-free spaces for pedestrians and bicyclists. Chan's district includes portions of Golden Gate Park, so she has been a central figure in the car-free JFK debates, if a somewhat bewildering one. JFK Drive wasone of the most dangerousstreets in San Franciscobefore Mayor London Breedtemporarily closed the eastern spanto provide more space for physical distancing and outdoor recreation during the COVID-19 pandemic. As pandemic restrictions began to lift,political and public consensusbegan to emerge aroundkeeping the eastern span of JFK Drive closed to vehicular traffic. Keeping JFK car-free was overwhelmingly popular with San Franciscans, with70% of SF Parks and Rec survey respondents in support, but the proposal wasbitterly opposed by the De Young Museum--and by Supervisor Chan. She ultimately introducednot one, buttwo alternative proposals, managing to confuse (and frustrate) nearly everyone involved by backtracking on how much of JFK Drive to close while alsoflatly refusing to compromise. Unsurprisingly, shevoted against the Board of Supervisors resolution to keep JFK car-free, alongside Supervisors Shamann Walton, Ahsha Safaí and Aaron Peskin. The issue was finally settled at the ballot box in November of 2022, with 63.5% of voters choosing to keep car-free JFK. Supervisor Chan has alsoconsistently supported the re-opening of Great Highwayto cars on weekends. She was one of only two supervisors tovote againstextending the weekend closures until 2025. When it comes to public transit, Chan cites accessibility as a top concern. She voted in favor of a\"Free MUNI\" pilot program in 2021aimed at restoring MUNI ridership levels,which plummeted during the pandemic.  The proposal wasopposed by MUNI agency leadersalready caught betweena looming budget deficitand theirstruggle to restore full service. Research suggests thata free MUNI pilot program would be largely ineffective without a stronger recovery in the downtown area. The measure was ultimatelyvetoed by Mayor Breed. Support for Small Businesses Chan has said that she supports \"permit and conditional waivers\" to support businesses that seek to occupy vacant spaces and \"reducing red tape\" through tax credits, streamlined permitting and tax code reform for local businesses. However, she has done little to support small businesses while in office. At the time of writing, her major vote has been to oppose letting small businessesclose their parklets overnight, increasing the burden on small business owners trying to survive the pandemic. Chanopposes Mayor Breed's plan to attract business downtown through tax breaks, but supports deferring payroll tax increases and reducing permitting requirements for pop-ups in vacant locales. School Board Reform In 2022, 72% of voterschose to recallthree incompetent school board members--a move opposed by Connie Chan. Voters were angry over the school board's failure to prioritize school re-openings during the pandemic; its decision to end merit-based admissions at San Francisco's top high school; itsill-timed and comically flawed school renaming effort; anda trail of embarrassing behavior by board member Alison Collins. But Supervisor Chanopposed the recall effort, citing a general opposition to all recalls. And after the mayor appointedfar better board membersto replace the recalled officials, Chancalled for new appointee Ann Hsu to resignover remarks characterizing a lack of family support and stability as one reason for the underperformance of \"marginalized students especially in the black and brown community.\" Fun Where but in San Francisco would we spend three months debating the extension of a ferris wheel contract, in the midst of a raging pandemic that threatened entire livelihoods, swatches of business and, oh right, the actual loss of human life? Despite approval from two separate city committees to extend the installation of a ferris wheel in Golden Gate Park for an additional four years so that SF families and visitors can have fun, Supervisors Chan and Aaron Peskindragged the contractbefore the full Board of Supervisors under the pretense that the ferris wheel, a temporary installation, was in fact a \"permanent structure.\" Chan and other members of the board's progressive bloc voted to overrule the four year extension, but ultimately lost the vote. In tandem, Chan and Peskinkicked off an investigationinto the San Francisco Parks Alliance (an independent non-profit that fundraises for Parks & Rec) alleging shady funding practices. Thereport turned up no wrongdoing.",
    "dean-preston": "Here's where Supervisor Preston stands on the issues:: Against Homebuilding Preston has routinely blocked, opposed, or delayed new home construction, including both market-rate developments and subsidized units. As a rule of thumb, he supports housing only if it is built by government, controlled by government, and subject to rent control. He will oppose other housing, although his stated reasons for opposition change depending on the project. For example, Preston has opposed homebuilding on subjective aesthetic grounds, claiming a project was too big and too modern for his \"intimate, historic neighborhood.\" He has also demanded that home builders market50% of units at below-market \"affordable\" prices—a figure that would make projects infeasible to build. He delayed upzoning a transit-rich area in his district to conduct a \"race and equity study\" thatnever happened. And he fought the construction of newsubsidized, affordablehomes by opposing UCSF's plan to build workforce housing by arguingboththat the proposal wasn't big enough (didn't include enough housing) and that it was so big that it would have an undue impact on the area. Along with opposing individual homebuilding projects, Preston also opposes structural changes to local and state law that would make it easier to build new homes. For example, hecampaigned againsta ballot initiative to speed up affordable housing production andopposeda state bill designed to build more homes in transit-rich neighborhoods. After the city failed to meet state housing targets—in part because of his obstruction—Preston called efforts to impose state-level oversight on San Francisco's housing crisis \"absurd.\" Taxation of Real Estate Preston has proposed addressing San Francisco's housing shortage by raising taxes on development—an approach that actually discourages new construction by making it more expensive. For example, he championed a newvacancy taxon unrented units, and spearheaded Proposition I (whichdoubled the transfer taxon certain real estate transactions).  Describing his philosophy, he hasstatedthat he sees higher taxes as a tool to \"address the coming wave of real estate speculation.\" Public Safety Preston hasdescribedhimself as a \"strong advocate for defunding the police,\" with an ultimate goal of \"prison abolition.\" He was a vocal cheerleader for recalled \"progressive\" district attorney Chesa Boudin, calling the recall \"idiotic\" and a \"gross, racist campaign.\" After acomfortable majorityof voters recalled Boudin, Preston doubled down and was theonly sitting supervisorto endorse John Hamasaki—another progressive DA candidate, whosupported defundingthe police andsuggestedpolice shouldn't confiscate guns from teenagers, who he thought might need guns for self-defense. In office, Preston has prioritized minimal policing over addressing public safety concerns. As the representative for the Tenderloin—a neighborhoodplaguedby drug abuse, tent encampments, property crime, and violence—Preston hasopposedthe Mayor's efforts to ramp up policing and enforcement, instead pushing for community ambassadors and street intervention teams. He has similarly resisted policing of property crimes. Whilerunning for officein 2019, he suggested that instead of using police to deter car break-ins, the city could have unarmed city employees intervene in thefts and justask thieves to stop. After car break-insworsenedduring his time in office, he suggested the city address the problem bytelling visitorsnot to leave anything in their cars. Open-Air Drug Dealing and Use Preston has been a vocal opponent of Mayor Breed's efforts to crack down on open air drug use, saying he was \"deeply disappointed and outraged,\" and that \"arresting drug users won't help people.\" Instead, Preston supportssafe consumption sitesto prevent overdoses; he's also called for \"destigmatizing addiction\" as a way to reduce overdose deaths on our streets. Preston's tolerance for open-air drug dealing and drug abuse has frustrated his constituents; for example, the Tenderloin Business Coalition hascriticized himfor failing to support efforts to shut down the open air drug markets that have taken over the neighborhood, and a poll by GrowSF found that93% of San Franciscans want dealers arrested, and 69% even support arresting users. Streets and Transit Preston has worked to improve public transit, walkability, and bicycle infrastructure in San Francisco. HesupportedCar-Free JFK, which closed portions of Golden Gate Park off from cars;lobbiedGovernor Newsom and the state legislature to support the Bay Area's cash-strapped transit agencies; and, as a daily transit user,campaigned ona \"Muni Riders Bill of Rights.\" However, his support for transit is sometimes hindered by a lack of practicality. For example, he has pushed for the city's MUNI system to beentirely free, which wasopposed by MUNI agency leadersalready caught betweena looming budget deficitand theirstruggle to restore full service. Research suggests thata free MUNI pilot program would be largely ineffective without a stronger recovery in the downtown area, but it would deprive MUNI of hundreds of millions dollars in needed revenue, potentially resulting in service cuts. Preston's proposal to run a free MUNI pilot was ultimatelyvetoed by Mayor Breed. When it comes to pedestrian safety, Preston can be an aggressive advocate: he recently called for San Francisco to banright turns at red lightscity-wide. But he's a vocal opponent of San Francisco's program to test out driverless vehicles,calling it\"irresponsible & reckless.\" Based on years of test data across millions of miles, driverless cars appear to besignificantly saferthan human drivers.",
    "hillary-ronen": "Here's where Supervisor Ronen stands on the issues: Street Homelessness Ronen chairs the Board of Supervisorscommitteeon homelessness, where she has overseen the city's unsuccessful efforts to reduce its unhoused population. The city's approach has been widely criticized for spending heavily, with few results. For example, in October 2023 Ronen's committee approved \"the most expensive homeless response ever,\" paying$140,000 annually per vehicleto have RVs park in an empty lot. Ronen's jurisdiction includes the Mission district, which contains many homeless encampments. Ronen supported building \"tiny cabins\" as a partial solution, butretreatedand said the plan might beoff the tableafter a community meeting where neighbors objected to housing homeless people nearby--even though she was \"clearly exasperated\" and called the neighbor objections \"a NIMBY thing.\" The cabinsmay stillbe built in her district, despite Ronen's inconsistent support. Public Safety Ronen is a frequent critic of the SFPD, although her critiques have shifted over time. In 2020, she was a leading proponent of defunding the police in San Francisco,saying: \"I want to make it clear that I believe strongly in defunding the police and reducing the number of officers on our force.\" But by 2023, Ronenreversed courseand began criticizing the SFPD for not providing enough police officers: \"I've been begging this department to give the Mission what it deserves in terms of police presence, all year long. And I've been told time and time and time and time again there are no officers that we can send to Mission.\" Ronen is a close ally and supporter of San Francisco's former district attorney, Chesa Boudin, who voters recalled from office in 2022. She endorsed him andraised fundsfor his campaign; opposed the recall andblamedSan Francisco's crime problems on the police force; and spoke out defiantly on the night Boudin was recalled, blaming \"billionaires\" anddeclaring: \"We are not done tonight or ever, fighting our system of injustice in the United States.\" Like Boudin, Ronen opposes prosecution of sex work, and has introduced legislation tolegalize prostitutionin San Francisco. Opposing Housing Development and Advocating for Price Controls Ronen has repeatedly voted to block housing development, arguing that homes are undesirable \"luxury housing\" unless they're subject to price controls or rent limits. For example, in 2018, Ronenblockedthe construction of a 75-unit building on the site of a laundromat; in 2021, she joined anti-housing supervisors inblocking495 homes at the site of a Nordstrom valet parking lot; and in 2023, sheblockedconversion of a single-family home into 10 units. In opposing rules that would streamline housing production, sheexplainedher philosophy: \"I don't believe that increasing the supply of luxury housing will trickle down... It's never going to happen.\" Transit An avid walker, Ronenbelievesin making SF's communities \"walkable, bikeable, and transit-oriented.\" She has supported public transportation when it's practical and, in some cases, even when it's less so. For example, sheadvocated forthe \"Free Muni\" program, which would have piloted making bus and light rail travel free in San Francisco. The programwas opposed bythe head of San Francisco's transit authority, who pointed out that it could overwhelm a system that was trying to recover from low ridership during the COVID-19 pandemic. Reports suggested that the transit authority was alsoconcernedthat the city's buses would become \"rolling homeless shelters,\" leading to a \"Muni Death Spiral.\" The Free Muni pilot was passed by the Board of Supervisors before beingvetoedby Mayor London Breed.",
    "joel-engardio": "Supervisor Engardio's top priorities include: Shutting down the fentanyl drug marketsRecruiting high-quality candidates to solve SFPD's officer shortageImproving our public schools by restoring merit admissions at Lowell and offering more advanced placement classesAuditing the city's $14B budget to root out corruption and wasteful spendingLowering the barriers to entrepreneurship by cutting bureaucratic red tapeMaking it easier to build more housing at all income levels by reforming byzantine permitting rules",
    "matt-dorsey": "Supervisor Dorsey has pointed to the following as issues he cares about: Housing A strong supporter of affordable housing, Dorsey hasrepeatedly emphasizedhis support for building housing at all income levels in San Francisco. At the time of his appointment to the Board, he described the role of D6 Supervisor as \"a forceful advocate for the promise of authentically progressive urbanism\" and noted that he was \"committed to removing constraints and barriers that make building housing more difficult.\" Dorsey vocally supported the pro-housing Proposition D, andvoted againstan ordinance that would have removed fast-track approval for certain developments. He hasnotedthat \"SF is the slowest jurisdiction in the state to move housing projects to construction.\" In April of 2023, Dorseyintroduced an ordinanceto reduce fees for projects seeking to convert vacant office buildings into housing. Transportation Dorsey represents a transit-heavy district that includes the Salesforce Transit Center, the SF Caltrain terminus, and the SF side of the Bay Bridge. He haspointed outthat his district has the most to lose if the city takes actions that threaten state-level funding for transportation, including—importantly—if the city loses funding by failing to meet California's requirements to build additional housing. Dorseydoesn't own a car, and commutes by taking public transit, biking, or walking. Dorseysupportedkeeping JFK Drive car-free andco-sponsoredthe ordinance to extend Great Highway's closure to cars on weekends. He hastweeted supportfor incentives for e-bike programs, as a way of reducing emissions. Public safety and police reform Dorsey'swebsitetouts his support for \"investing in public safety resources so people can feel safe in their communities.\" Before his appointment to the Board, Dorsey served as the Director of Strategic Communications for the San Francisco Police Department, and as a Supervisor he has advocated for a better-staffed and more effective police force. Dorsey proposed (unsuccessfully) a carve out to San Francisco's sanctuary city policy to allow the SFPD to cooperate with federal authorities to deport suspected fentanyl dealers. He voted to allow SFPD to use private video camera footage, supported funding for police overtime and, with Supervisor Stefani, introduced a ballot measure to establish mandated staffing levels and funding for the police force. Addiction As the first elected Supervisor in active recovery for substance abuse, Supervisor Dorsey has been a major advocate for better solutions for addiction. With Supervisors Mandelman and Stefani, Dorseyunveiled the San Francisco Recovers plan,an ambitious proposalto tackle drug dealing, addiction, and drug-related deaths through a coordinated response across multiple city agencies. Dorseytoured safe injection sitesin New York City, alongside Supervisor Hillary Ronen.",
    "myrna-melgar": "Here's where Supervisor Melgar stands on the issues: Public safety Melgar has proposed firing all police officers without cause and rebuilding the department from the ground up. Asshe put it, she \"support[s]disbanding the SFPD and requiring officers to reapply to a newly constructed, less violent police force.\" Melgaropposedrecalling former DA Chesa Boudin. And like Boudin, she has opposed cracking down on fentanyl dealing and open-air drug abuse on the city's streets. Sharing her perspective, she told the SF Chronicle thatshe doesn't view drug tourism as a concern: \"People have come to San Francisco to do drugs always. This is not new.\" She expressed concern with overdose deaths, but also worried that enforcing drug laws is \"criminalizing people.\" Melgar has been particularly focused on protecting drug dealers who enter the country illegally. As the Chroniclereported in extensive detail, many dealers are undocumented immigrants from Honduras who come here specifically to sell drugs on our streets. They can't be deported because San Francisco is a sanctuary city (i.e., the city doesn't cooperate with federal immigration authorities). And they exploit a California law that allows defendants to claim they were \"trafficked\": dealers haverepeatedly escaped convictionby arguing that they were under the control of coyotes or cartels, so they shouldn't be held responsible for their actions. Supervisor Dorsey proposed addressing this by creating an exception to the city's sanctuary laws that would allow fentanyl dealers to be deported. Melgar voted against the proposal, which shecompared to Nazi Germany and called \"totally counter to our San Francisco values.\"She thenled a protestagainst the proposal on the steps of City Hall. Housing Melgarcampaignedas a pro-housing candidate, and housing advocates hoped that she would use her experience as a leader in the city's Department of Building Inspections and Planning Department to combat the city's housing shortage. Unfortunately, she has repeatedly voted to block housing, including a controversial vote to block 495 units ofhousing on a valet parking lot(24% of which would have been \"affordable\" housing priced below market rates), and a vote to blockconverting a single-family homeinto 10 units, among others. On the positive side, she has supported measures to make it easier for homeowners to build accessory dwelling units, and has proposed allowing the division of certain large homes in her neighborhood into smaller units. Transportation Melgar has identified transportation as one of her top priorities, and has generally voted in favor of public transportation. Shesupportedkeeping JFK Drive car-free and reportedlybikes to work. But she also favors drivers over pedestrians and cyclists at times; for example, sheopposedextending the Great Highway's closure to cars on weekends. Homelessness Melgar identifies homelessness as a top priority, but she has not been a leader on homeless issues or proposed meaningful fixes to the problem. Homelessness hasgrown in her districtsince she took office (despitefalling in SFas a whole). Promotion of progressive candidates Melgar has promised to prioritize voting for \"the most progressive candidate always,\" as long as the candidate also meets her racial and gender requirements. She has carried this out in office, nominating far-left supervisors Shamann Walton and Connie Chan for Board of Supervisors President, and opposing the recalls of far-left officials Alison Collins and Gabriela Lopez (who were recalled from the SF School Board) and Chesa Boudin (who was recalled as SF District Attorney). In choosing what candidates to support for public office, Melgar has promised to prioritize a candidate's race and gender above other considerations, including what those candidates actually believe. In awritten statementseeking the endorsement of a local political club, she described her \"system for endorsements\": I will support the most progressive candidate always, except if that candidate is a cis hetero white man, in which case I will instead support in this order, the most progressive:Black manBlack womanPerson of ColorGay personWomanIf a cis hetero white progressive man is running against any of the above or a white cis hetero woman, I will make no endorsement.",
    "rafael-mandelman": "Here's where Supervisor Mandelman stands on the issues: Mental Health & Homelessness Mandelman has witnessed the mental health and homelessness crisis firsthand throughhis mother, who suffered with both, shaping his views on state-sponsored interventions and conservatorship. In early 2020, shortly before the pandemic began, Mandelman and Mayor Breed announced that the cityacquiredtwo mental health facilities, in NoPa and the Mission. Mandelman has called for more court-ordered mental health treatment,noting: \"There are unhoused people who simply need a home, and then there are people who really need more than that. We need to do a better job as a county of trying to make all of those levels of care available. But we also need to be pushing on the state to help fund that.\" Although the city implemented a statepilot programin 2019, by early 2022only two peoplehad been placed under conservatorship. Mandelman has also advocated for moving people from tent encampments to city-provided shelter (in contrast to the city's typical approach of leaving people in tents until they receive \"permanent supportive housing\"). Calling the current homelessness experience \"inhumane\" and \"irrational,\" in early 2022, Mandelman introduced his\"A Place for All\" initiative, requiring the city to provide shelter to everyone willing to accept it. He alsosupports effortsto clarify that those who refuse shelter cannot be considered \"involuntarily homeless,\" which would allow the city to remove their tents from public spaces. The city's encampments,he said, \"are dangerous for the people who are in them and terrible for the people who are trying to live and work in those neighborhoods . . . . We have hundreds of people a year dying of overdoses.\" Housing Mandelman claims to be a \"pro-housing voice,\" andcampaigned on\"address[ing]the housing crisis,\" but has repeatedly voted to block housing in San Francisco. He voted to block building housing on aNordstrom valet parking lot, which included 24% affordable units, and voted againstconverting a single-family homeinto 10 units. He joined arguably San Francisco's most anti-housing supervisor, Aaron Peskin, in sponsoring legislation that--had it not failed--could havedisastrously limitedhousing development. After a host of officials and builders came out against the \"terrifying\" legislation, even Peskin acknowledged that the proposal was a failure. Mandelman alsoopposedSB50, Senator Wiener's proposal to increase housing density in areas around public transit stops. Mandelman did try to support housing production with atwo-part proposalto both legalize building multi-unit fourplexes and to make it harder to build large single-family homes--the idea being to promote more small units, which would be more affordable. But other supervisors amended and watered down the bill and Mayor Breed eventuallyvetoedit, stating that in its final form it would interfere with a pro-housing state law and actually hurt housing production. Public Safety Mandleman has been a moderating voice on public safety issues, resisting the Board of Supervisors's most extreme anti-law-enforcement tendencies. He wasa relative voice of reasonduring the board's effort to defund the police in 2020, pushing back on supervisors who wanted to cancel all police academy classes and slash police overtime. Similarly, when Supervisor Peskin passed legislation to limit the SFPD from using surveillance technologies, Mandelmanscrutinizedthe measure and, after it passed,supported different legislationthat re-authorized some use of surveillance cameras. Mandelmandeclined to take a public positionon the recall of former District Attorney Chesa Boudin, butpersonally votedin favor of the recall and endorsed Brooke Jenkins,the strongest candidate and the only real prosecutor running for DA, to succeed Boudin. In May 2023,Mandelman called out SFPD'slow rates of traffic citations, contributing to the city failing to meet the goals of Vision Zero that were set almost 10 years ago. \"Our streets are as deadly as ever,\" he said, calling for SFPD to restore enforcement to at least the same levels as 2014. Streets & Transit Mandelman ischairof the Board of the San Francisco County Transportation Authority, which funds and plans public transit options in the city. Heled the pushfor Proposition L on the Nov. 2022 ballot, which renewed a sales tax to fund $2.6b of transit costs over 30 years. Heco-sponsoredMayor Breed's legislation to make JFK Drive, in Golden Gate Park, a permanent car-free space for use by pedestrians and cyclists.",
    "shamann-walton": "Here's where Supervisor Walton stands on the issues: Public Education Likeothersin local politics, Walton used the Board of Education as a stepping stone to become a supervisor. As a member of the Board of Education from 2014-2019 (andpresidentfrom 2017-2019), Walton had a hand in creating many of the problems that plague the city's public schools today. For example, during Walton's presidency the BOE launched itsdisastrous projectto select a new payroll system, which failed to pay teachers correctly and ran dramatically over budget. As BOE president, and later as a supervisor, he helped his ideological allies control the city's educational policy. He endorsedAlison CollinsandFaauuga Moligafor the BOE (two of the three failed school board members who voters later recalledby overwhelming margins). Heopposedthe recalls. After the recalls succeeded he doubled down,endorsing Gabriela López--the third recalled board member, and the only one that ran again after being recalled. López lost her bid to rejoin the boardby a large margin, despite Walton's endorsement. Walton has advocated for stripping merit-based admission from Lowell (San Francisco's flagship high school),callingthe school's grades-based admissions criteria \"a racist policy\" and opining that \"it's unfathomable\" that people would want one of SF's schools to focus on high-achieving students (instead of admitting students through a lottery like the city's other public schools). Public Safety Walton has been anoutspoken advocatefor defunding the police. In 2020, hepartneredwith the mayor's office \"to reinvest $120 million . . . from law enforcement into San Francisco's Black and African-American community.\" While he was successful in redirecting funds, the mayorlaterdirected other funds to the police force to avoid cutting officers. Walton was also a passionate defender of former district attorney Chesa Boudin. He opposed giving voters an opportunity to recall Boudin for his refusal to enforce criminal laws,opiningthat \"it is extremely dangerous to use recalls strictly because you don't agree with someone's views.\" Faced with the recalls of his allies on the BOE and in the DA's office, Waltontriedto limit voter's ability to recall future officials, but votersrejectedhis attempt. Walton has also worked toshutter the city's juvenile hall. Housing Walton consistently votes against new housing in San Francisco, claiming that new housing causes displacement (despiteevidencethat new housing \"actually benefits incumbent tenants by reducing rents, evictions, and the risk of moves to poorer zipcodes\"). For example, Walton was the only member of the BOS to oppose allowing homeowners to convert their corner lots into four-plexes,claimingthat it \"would speed up the gentrification in areas like Bayview.\" He alsoopposedbuilding family-sized housing units on a Nordstrom valet parking lot, amongother projects, andopposedchanging California law to encourage denser housing near job-rich areas and transit hubs."
}